## Les fonctions on va apprendre:
- DataFrame(data =)
- .values .columns

### DataFrame
DataFrame est une structure de données tabulaire. DataFrame se compose de plusieurs colonnes de données disposées dans un certain ordre. L'intention initiale de la conception est de changer les scénarios d'utilisation de Series d'unidimensionnel à multidimensionnel, et DataFrame a à la fois un index de ligne et un index de colonne.
- Index de ligne : index
- Index de colonne : colonnes
- Valeur : valeurs

La création de DataFrame:
- La création de ndarray
- La création de dictionnaire

In [3]:
import numpy as np
from pandas import DataFrame

In [5]:
DataFrame(data=[[1,2,3],[4,5,6]])

   0  1  2
0  1  2  3
1  4  5  6

In [6]:
DataFrame(data=np.random.randint(0,100,size=(6,4)))

    0   1   2   3
0  68   4  37  95
1  70  88  13  28
2  78  72  63  66
3  83  80  33  58
4  70  66  34  70
5  34  24  67   4

In [12]:
dic = {
    'name' : ['amanda','lilly','helene'],
    'salary' : [1000,2000,3000]
}
df = DataFrame(data=dic,index = ['a','b','c'])
df

     name  salary
a  amanda    1000
b   lilly    2000
c  helene    3000

In [13]:
df.values

array([['amanda', 1000],
       ['lilly', 2000],
       ['helene', 3000]], dtype=object)

In [14]:
df.columns

Index(['name', 'salary'], dtype='object')

In [15]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [16]:
df.shape

(3, 2)